tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "autossh"
brew "bat"
brew "libyaml"
brew "cocoapods"
brew "coreutils"
brew "cowsay"
brew "diff-so-fancy"
brew "diffutils"
brew "eza"
brew "figlet"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gcc"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "grep"
brew "gzip"
brew "jq"
brew "libffi"
brew "python@3.12"
brew "lua"
brew "luarocks"
brew "neofetch"
brew "neovim"
brew "node"
brew "procs"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "rename"
brew "rsync"
brew "rust"
brew "socat"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"
cask "alacritty", args: { appdir: "~/Applications" }
cask "alt-tab", args: { appdir: "~/Applications" }
cask "appcleaner", args: { appdir: "~/Applications" }
cask "bitwarden", args: { appdir: "~/Applications" }
cask "boop", args: { appdir: "~/Applications" }
cask "chromedriver"
cask "chatgpt", args: { appdir: "~/Applications" }
cask "discord", args: { appdir: "~/Applications" }
cask "drawio", args: { appdir: "~/Applications" }
cask "fantastical", args: { appdir: "~/Applications" }
cask "figma", args: { appdir: "~/Applications" }
cask "firefox@developer-edition", args: { appdir: "~/Applications" }
cask "font-fira-code", args: { appdir: "~/Applications" }
cask "font-fira-mono-nerd-font", args: { appdir: "~/Applications" }
cask "font-hack", args: { appdir: "~/Applications" }
cask "font-hack-nerd-font", args: { appdir: "~/Applications" }
cask "font-inconsolata", args: { appdir: "~/Applications" }
cask "font-meslo-lg-nerd-font", args: { appdir: "~/Applications" }
cask "gimp", args: { appdir: "~/Applications" }
cask "handbrake", args: { appdir: "~/Applications" }
cask "hyperkey", args: { appdir: "~/Applications" }
cask "iterm2", args: { appdir: "~/Applications" }
cask "postman", args: { appdir: "~/Applications" }
cask "raycast", args: { appdir: "~/Applications" }
cask "readdle-spark", args: { appdir: "~/Applications" }
cask "rectangle", args: { appdir: "~/Applications" }
cask "spotify", args: { appdir: "~/Applications", require_sha: false }
cask "stats", args: { appdir: "~/Applications" }
cask "sublime-text", args: { appdir: "~/Applications" }
cask "teamviewer", args: { appdir: "~/Applications" }
cask "visual-studio-code", args: { appdir: "~/Applications" }
cask 'vlc', args: { appdir: "~/Applications" }
cask "warp", args: { appdir: "~/Applications" }
cask "wireshark", args: { appdir: "~/Applications" }
cask "zoom", args: { appdir: "~/Applications" }
